---
kind: type
id: T:Autodesk.Revit.DB.Line
zh: 线、直线
source: html/e7329450-434a-918b-661c-65e15e0585a5.htm
---
# Autodesk.Revit.DB.Line

**中文**: 线、直线

A line in space.

## Syntax (C#)
```csharp
public class Line : Curve
```